Revit 2024 API
HorizontalCurveEndpoint.PreviousCurveType Property
 The HorizontalCurveType of the curve which connects the endpoint to the previous displayed curve. If this endpoint's Station equals DisplayedStartStation, returns Unknown curve type.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public HorizontalCurveType PreviousCurveType { get; internal set; }
Visual Basic
Public Property PreviousCurveType As HorizontalCurveType
	Get
	Friend Set
Visual C++
public:
property HorizontalCurveType PreviousCurveType {
	HorizontalCurveType get ();
	internal: void set (HorizontalCurveType value);
}
See Also
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace